tv4you2016/ESP32-audioI2S-esphome/src/Audio.h
/*
 * Audio.h
 *
 */

#pragma once

// —————————————————————————————————————————————————————————————————————————————
// 📌 Codec Selection
// Comment out the codecs you don't need to save flash and RAM.
// —————————————————————————————————————————————————————————————————————————————
#define AUDIO_CODEC_MP3
#define AUDIO_CODEC_AAC
// #define AUDIO_CODEC_M4A
// #define AUDIO_CODEC_FLAC
// #define AUDIO_CODEC_WAV
// #define AUDIO_CODEC_OGG          // Active le pack OGG (Conteneur + Opus)
// #define AUDIO_CODEC_VORBIS       // Support Vorbis (+108 Ko Flash)
// #define AUDIO_ENABLE_FS
// #define AUDIO_ENABLE_SPEECH
// #define AUDIO_ENABLE_VUMETER     // Active les calculs de spectre et niveaux (VU-meter)
//  —————————————————————————————————————————————————————————————————————————————
//  📌 Log Level Selection
//  0: None, 1: Error, 2: Warning, 3: Info, 4: Debug
//  —————————————————————————————————————————————————————————————————————————————
#define AUDIO_LOG_LEVEL 3
// —————————————————————————————————————————————————————————————————————————————
//  📌 Equalizer Headroom Strategy
//  0: Full protection, 1: 50% Hybrid, 2: Disabled (Max Power)
//  —————————————————————————————————————————————————————————————————————————————
#define AUDIO_EQ_HEADROOM_MODE 2 
// —————————————————————————————————————————————————————————————————————————————
// 📌 Volume Settings
// Higher value = slower ramp (fade), Lower value = faster ramp.
// Default is 50. Set to 25 to divide mute/unmute time by 2.
// —————————————————————————————————————————————————————————————————————————————
#define AUDIO_VOLUME_RAMP_STEPS 25
// #define CurveOff345              // Uncomment to use original v3.4.5 polynomial volume curves instead of restored SB curves
// —————————————————————————————————————————————————————————————————————————————

// 🔗 Automatic Dependencies
#ifdef AUDIO_CODEC_M4A
#ifndef AUDIO_CODEC_AAC
#define AUDIO_CODEC_AAC // M4A requires AAC decoder
#endif
#endif

#ifdef AUDIO_CODEC_VORBIS
#ifndef AUDIO_CODEC_OGG
#define AUDIO_CODEC_OGG // Vorbis requires OGG container
#endif
#endif

#ifdef AUDIO_CODEC_OGG
#ifndef AUDIO_CODEC_OPUS
#define AUDIO_CODEC_OPUS // OGG pack includes Opus by default
#endif
#endif

#pragma GCC optimize("Ofast")
#include "audiolib_structs.hpp"
#include "esp_arduino_version.h"
#include "esp_dsp.h"
#include "psram_unique_ptr.hpp"
#include <Arduino.h>
#ifdef AUDIO_ENABLE_FS
#include <FFat.h>
#include <FS.h>
#include <SD.h>
#include <SD_MMC.h>
#endif
#include <NetworkClient.h>
#include <NetworkClientSecure.h>
//#include <WiFi.h>
#include <atomic>
#include <charconv>
#include <codecvt>
#include <deque>
#include <driver/i2s_std.h>
#include <esp32-hal-log.h>
#include <functional>
#include <libb64/cencode.h>
#include <locale>
#include <memory>
#include <span>
#include <vector>

#ifndef I2S_GPIO_UNUSED
#define I2S_GPIO_UNUSED -1 // = I2S_PIN_NO_CHANGE in IDF < 5
#endif

extern __attribute__((weak)) void audio_process_raw_samples(int32_t *outBuff, int16_t validSamples);            // before volume, gain and equalizer, record audiodata
extern __attribute__((weak)) void audio_process_i2s(int32_t *outBuff, int16_t validSamples, bool *continueI2S); // after volume, gain and equalizer, send via BT
extern char audioI2SVers[];
class Decoder; // prototype

// Audio event type descriptions
static constexpr std::array<const char *, 13> eventStr = {"info", "id3data", "eof", "station_name", "icy_description", "streamtitle", "bitrate",
                                                          "icy_url", "icy_logo", "lasthost", "cover_image", "lyrics", "log"};
//----------------------------------------------------------------------------------------------------------------------
class AudioBuffer
{

public:
    AudioBuffer();  // constructor
    ~AudioBuffer(); // frees the buffer
    size_t init();  // set default values
    bool isInitialized() { return m_init; };
    size_t getBufsize();
    size_t getMaxBlockSize(); // returns maxBlockSize
    void setMaxBlocksize(uint32_t mbs);
    size_t freeSpace();           // number of free bytes to overwrite
    size_t writeSpace();          // space fom writepointer to bufferend
    size_t bufferFilled();        // returns the number of filled bytes
    size_t readSpace();           // max readable bytes in one block
    void bytesWritten(size_t bw); // update writepointer
    void bytesWasRead(size_t br); // update readpointer
    uint8_t *getWritePtr();       // returns the current writepointer
    uint8_t *getReadPtr();        // returns the current readpointer
    void reset();                 // restore defaults
    void showStatus();

protected:
    size_t m_mainBuffSize = 0; // most webstreams limit the advance to 100...300Kbytes
    size_t m_freeSpace = 0;
    size_t m_writeSpace = 0;
    size_t m_resBuffSize = 0;
    size_t m_maxBlockSize = 0;
    size_t m_readSpace = 0;
    const size_t m_maxRet = UINT16_MAX;
    ps_ptr<uint8_t> m_buffer;
    uint8_t *m_buffEnd = nullptr;
    uint8_t *m_writePtr = nullptr;
    uint8_t *m_readPtr = nullptr;
    uint8_t *m_endPtr = nullptr;
    uint8_t *m_startPtr = nullptr;
    bool m_init = false;
    bool m_isEmpty = true;
    bool m_isFull = false;

private:
    SemaphoreHandle_t m_mutex = nullptr;
};
//----------------------------------------------------------------------------------------------------------------------

class Audio
{
private:
    AudioBuffer InBuff; // instance of input buffer

public:
    Audio(uint8_t i2sPort = I2S_NUM_0);
    ~Audio();
    std::mutex mutex_info; // mutex_info as member

    // callbacks ---------------------------------------------------------
    typedef enum
    {
        evt_info = 0,
        evt_id3data,
        evt_eof,
        evt_name,
        evt_icydescription,
        evt_streamtitle,
        evt_bitrate,
        evt_icyurl,
        evt_icylogo,
        evt_lasthost,
        evt_image,
        evt_lyrics,
        evt_log
    } event_t;
    typedef struct _msg
    { // used in info(audio_info_callback());
        const char *msg = nullptr;
        const char *s = nullptr;
        event_t e = (event_t)0; // event type
        uint8_t i2s_num = 0;
        int32_t arg1 = 0;
        int32_t arg2 = 0;
        std::vector<uint32_t> vec = {}; // apic [pos, len, pos, len, pos, len, ....]
    } msg_t;
    inline static std::function<void(msg_t i)> audio_info_callback;
    // -------------------------------------------------------------------

#ifdef AUDIO_ENABLE_SPEECH
    bool openai_speech(const char *api_key, const char *model, const char *input, const char *instructions, const char *voice, const char *response_format, const char *speed);
#endif
    audiolib::hwoe_t dismantle_host(const char *host);
    bool connecttohost(const char *host, const char *user = "", const char *pwd = "");
#ifdef AUDIO_ENABLE_SPEECH
    bool connecttospeech(const char *speech, const char *lang);
#endif
#ifdef AUDIO_ENABLE_FS
    bool connecttoFS(fs::FS &fs, const char *path, int32_t fileStartTime = -1);
#endif
    void setConnectionTimeout(uint16_t timeout_ms, uint16_t timeout_ms_ssl);
    bool setAudioPlayTime(uint16_t sec);
    bool setTimeOffset(int sec);
    bool setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT, int8_t MCLK = I2S_GPIO_UNUSED);
    bool pauseResume();
    bool isRunning() { return m_f_running; }
    void loop();
    uint32_t stopSong();
    void forceMono(bool m);
    void setOutput48KHz(bool f48);
    void setBalance(float balance = 0.0f);
    void setVolumeSteps(uint8_t steps);
    uint8_t getVolumeSteps();
    void setVolume(uint8_t vol, uint8_t curve = 0);
    uint8_t getVolume();
    void setMute(bool mute);
    bool getMute();
    uint8_t getI2sPort();
    uint32_t getFileSize();
    uint32_t getSampleRate();
    uint8_t getBitsPerSample();
    uint8_t getChannels();
    uint32_t getBitRate();
    uint32_t getAudioFileDuration();
    uint32_t getAudioCurrentTime();
    uint32_t getAudioFilePosition();
    bool setAudioFilePosition(uint32_t pos);
    uint16_t getVUlevel();
    uint32_t inBufferFilled();  // returns the number of stored bytes in the inputbuffer
    uint32_t inBufferFree();    // returns the number of free bytes in the inputbuffer
    uint32_t getInBufferSize(); // returns the size of the inputbuffer in bytes
    void inBufferStatus() { InBuff.showStatus(); }
    void setTone(float gainLowPass, float gainBandPass, float gainHighPass);
    void setToneFrequencies(uint16_t freqLS, uint16_t freqPEQ, uint16_t freqHS);
    void getToneFrequencies(uint16_t *freqLS, uint16_t *freqPEQ, uint16_t *freqHS);
    void setI2SCommFMT_LSB(bool commFMT);
    int getCodec() { return m_codec; }
    const char *getCodecname() { return codecname[m_codec]; }
    const char *getVersion() { return audioI2SVers; }

    // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

