tv4you2016/ESP32-audioI2S-esphome/src/Audio.h
private:
    // ------- PRIVATE MEMBERS ----------------------------------------
    std::unique_ptr<Decoder> createDecoder(const char *type);
    void destroy_decoder();
#ifdef AUDIO_ENABLE_FS
    bool fsRange(uint32_t range);
#endif
    void latinToUTF8(ps_ptr<char> &buff, bool UTF8check = true);
    void htmlToUTF8(char *str);
    void setDefaults(); // free buffers and set defaults
    int32_t audioFileRead(uint8_t *buff = nullptr, size_t len = 0);
    int32_t audioFileSeek(uint32_t position, size_t len = 0);
    void initInBuff();
    bool httpPrint(const char *host);
    bool httpRange(uint32_t range, uint32_t length = UINT32_MAX);
#ifdef AUDIO_ENABLE_FS
    void processLocalFile();
#endif
    void processWebStream();
    void processWebFile();
    void processWebStreamTS();
    void processWebStreamHLS();
    void playAudioData();
    bool readPlayListData();
    const char *parsePlaylist_M3U();
    const char *parsePlaylist_PLS();
    const char *parsePlaylist_ASX();
    ps_ptr<char> parsePlaylist_M3U8();
    uint16_t accomplish_m3u8_url();
    int16_t prepare_first_m3u8_url(ps_ptr<char> &playlistBuff);
    ps_ptr<char> m3u8redirection(uint8_t *codec);
    void showCodecParams();
    int findNextSync(uint8_t *data, size_t len);
    uint32_t decodeError(int8_t res, uint8_t *data, int32_t bytesDecoded);
    uint32_t decodeContinue(int8_t res, uint8_t *data, int32_t bytesDecoded, int32_t *bytesLeft);
    int sendBytes(uint8_t *data, size_t len);
    void setDecoderItems();
    void calculateAudioTime(uint16_t bytesDecoderIn, uint16_t bytesDecoderOut);
    void showID3Tag(const char *tag, const char *val);
    size_t readAudioHeader(uint32_t bytes);
#ifdef AUDIO_CODEC_WAV
    int read_WAV_Header(uint8_t *data, size_t len);
#endif
#ifdef AUDIO_CODEC_FLAC
    int read_FLAC_Header(uint8_t *data, size_t len);
#endif
    int read_ID3_Header(uint8_t *data, size_t len);
#ifdef AUDIO_CODEC_M4A
    int read_M4A_Header(uint8_t *data, size_t len);
#endif
    size_t process_m3u8_ID3_Header(uint8_t *packet);
    bool setSampleRate(uint32_t hz);
    bool setBitsPerSample(int bits);
    bool setChannels(int channels);
    uint32_t resampleTo48kStereo(audiolib::resampler_t &resampler, int32_t *input, uint32_t inputSamples, int32_t *output);
    void playChunk();
    void calculateVUlevel(int32_t *sample);
    void processSpectrum();
    void gain_ramp();
    void calculateVolumeLimits();
    void Gain(int32_t *sample);
    void showstreamtitle(char *ml);
    bool parseContentType(char *ct);
    bool parseHttpResponseHeader();
    bool parseHttpRangeHeader();
    bool initializeDecoder();
    esp_err_t I2Sstart();
    esp_err_t I2Sstop();
    void zeroI2Sbuff();
    void reconfigI2S();
    void stereo2mono(int32_t *buff, uint16_t validSamples);
    void IIR_calculateCoefficients();
    void IIR_filter(int32_t *iir_in);
    uint32_t streamavail() { return m_client ? m_client->available() : 0; }
    bool ts_parsePacket(uint8_t *packet, uint8_t *packetStart, uint8_t *packetLength);
    uint64_t getLastGranulePosition(uint8_t codec);

    //+++ create a T A S K  for playAudioData(), output via I2S +++
public:
    void setAudioTaskCore(uint8_t coreID);
    uint32_t getHighWatermark();

private:
    void startAudioTask(); // starts a task for decode and play
    void stopAudioTask();  // stops task for audio
    static void audioTaskWrapper(void *param);
    void audioTask();
    void performAudioTask();

    //+++ H E L P   F U N C T I O N S +++
    bool readMetadata(uint16_t b, uint16_t *readedBytes, bool first = false);
    int32_t getChunkSize(uint16_t *readedBytes, bool first = false);
#ifdef AUDIO_ENABLE_FS
    bool readID3V1Tag();
#endif
    int32_t newInBuffStart(int32_t resumeFilePos);
    boolean streamDetection(uint32_t bytesAvail);
    uint32_t m4a_correctResumeFilePos();
    uint32_t ogg_correctResumeFilePos();
    int32_t flac_correctResumeFilePos();
    int32_t mp3_correctResumeFilePos();
    int32_t wav_correctResumeFilePos();
    uint8_t determineCodec(uint8_t presumed_codec);
    void strlower(char *str);
    void trim(char *str);
    bool startsWith(const char *base, const char *str);
    bool endsWith(const char *base, const char *searchString);
    int indexOf(const char *base, const char *str, int startIndex = 0);
    int indexOf(const char *base, char ch, int startIndex = 0);
    int lastIndexOf(const char *haystack, const char *needle);
    int lastIndexOf(const char *haystack, const char needle);
    int specialIndexOf(uint8_t *base, const char *str, int baselen, bool exact = false);
    int specialIndexOfLast(uint8_t *base, const char *str, int baselen);
    int find_utf16_null_terminator(const uint8_t *buf, int start, int max);
    int32_t min3(int32_t a, int32_t b, int32_t c);
    uint64_t bigEndian(uint8_t *base, uint8_t numBytes, uint8_t shiftLeft = 8);
    bool b64encode(const char *source, uint16_t sourceLength, char *dest);
    void vector_clear_and_shrink(std::vector<ps_ptr<char>> &vec);
    void deque_clear_and_shrink(std::deque<ps_ptr<char>> &deq);
    uint32_t simpleHash(const char *str);
    ps_ptr<char> urlencode(const char *str, bool spacesOnly);
    uint32_t bswap32(uint32_t x);
    uint64_t bswap64(uint64_t x);
    audiolib::BiquadCoeffs makeButterworthLPF_Q31(float fs);

private:
    enum : int
    {
        APLL_AUTO = -1,
        APLL_ENABLE = 1,
        APLL_DISABLE = 0
    };
    enum : int
    {
        EXTERNAL_I2S = 0,
        INTERNAL_DAC = 1,
        INTERNAL_PDM = 2
    };
    enum : int
    {
        FORMAT_NONE = 0,
        FORMAT_M3U = 1,
        FORMAT_PLS = 2,
        FORMAT_ASX = 3,
        FORMAT_M3U8 = 4
    };                                                                                       // playlist formats
    static constexpr const char *const plsFmtStr[5] = {"NONE", "M3U", "PLS", "ASX", "M3U8"}; // playlist format string
    enum : int
    {
        AUDIO_NONE,
        HTTP_RESPONSE_HEADER,
        HTTP_RANGE_HEADER,
        AUDIO_DATA,
        AUDIO_LOCALFILE,
        AUDIO_PLAYLISTINIT,
        AUDIO_PLAYLISTHEADER,
        AUDIO_PLAYLISTDATA
    };
    static constexpr const char *const dataModeStr[8] = {"AUDIO_NONE", "HTTP_RESPONSE_HEADER", "HTTP_RANGE_HEADER", "AUDIO_DATA", "AUDIO_LOCALFILE", "AUDIO_PLAYLISTINIT", "AUDIO_PLAYLISTHEADER", "AUDIO_PLAYLISTDATA"};
    enum : int
    {
        FLAC_BEGIN = 0,
        FLAC_MAGIC = 1,
        FLAC_MBH = 2,
        FLAC_SINFO = 3,
        FLAC_PADDING = 4,
        FLAC_APP = 5,
        FLAC_SEEK = 6,
        FLAC_VORBIS = 7,
        FLAC_CUESHEET = 8,
        FLAC_PICTURE = 9,
        FLAC_OKAY = 100
    };
    enum : int
    {
        MP3_BEGIN = 0,
        MP3_ID3HEADER,
        MP3_NEXTID3,
        MP3_EXTHEADER,
        MP3_ID3FRAME,
        MP3_FRAMESIZE,
        MP3_SKIP,
        MP3_TAG,
        MP3_SYLT,
        MP3_ID3V22,
        MP3_LASTFRAMES,
        MP3_XING,
        MP3_OKAY = 100
    };
    enum : int
    {
        M4A_BEGIN = 0,
        M4A_FTYP = 1,
        M4A_CHK = 2,
        M4A_MOOV = 3,
        M4A_FREE = 4,
        M4A_TRAK = 5,
        M4A_MDAT = 6,
        M4A_ILST = 7,
        M4A_MP4A = 8,
        M4A_ESDS = 9,
        M4A_MDIA = 10,
        M4A_MINF = 11,
        M4A_STBL = 12,
        M4A_STSD = 13,
        M4A_UDTA = 14,
        M4A_STSZ = 15,
        M4A_META = 16,
        M4A_MDHD = 17,
        M4A_CHPL = 18,
        M4A_AMRDY = 99,
        M4A_OKAY = 100,
    };
    enum : int
    {
        CODEC_NONE = 0,
        CODEC_WAV = 1,
        CODEC_MP3 = 2,
        CODEC_AAC = 3,
        CODEC_M4A = 4,
        CODEC_FLAC = 5,
        CODEC_OPUS = 6,
        CODEC_VORBIS = 7,
        CODEC_OGG = 8
    };
    static constexpr const char *const codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "OPUS", "VORBIS", "OGG"};
    enum : int
    {
        ST_NONE = 0,
        ST_WEBFILE = 1,
        ST_WEBSTREAM = 2
    };
    static constexpr const char *const streamTypeStr[3] = {"NONE", "WEBFILE", "WEBSTREAM"};
    typedef enum
    {
        LEFTCHANNEL = 0,
        RIGHTCHANNEL = 1
    } SampleIndex;
    typedef enum
    {
        LOWSHELF = 0,
        PEAKINGEQ = 1,
        HIFGSHELF = 2
    } FilterType;

