tv4you2016/ESP32-audioI2S-esphome/src/Audio.h
private:
    typedef struct _filter
    {
        float a0;
        float a1;
        float a2;
        float b1;
        float b2;
    } filter_t;

    typedef struct _pis_array
    {
        int number;
        int pids[4];
    } pid_array;

#ifdef AUDIO_ENABLE_FS
    File m_audiofile;
#endif
    NetworkClient client;
    NetworkClientSecure clientsecure;
    NetworkClient *m_client = nullptr;

    SemaphoreHandle_t mutex_playAudioData;
    SemaphoreHandle_t mutex_audioTask;
    SemaphoreHandle_t mutex_audioTaskIsDecoding;
    TaskHandle_t m_audioTaskHandle = nullptr;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"

    i2s_chan_handle_t m_i2s_tx_handle = {};
    i2s_chan_config_t m_i2s_chan_cfg = {}; // stores I2S channel values
    i2s_std_config_t m_i2s_std_cfg = {};   // stores I2S driver values

#pragma GCC diagnostic pop

    std::vector<ps_ptr<char>> m_playlistContent; // m3u8 playlist buffer from responseHeader
    std::vector<ps_ptr<char>> m_playlistURL;     // m3u8 streamURLs buffer
    std::deque<ps_ptr<char>> m_linesWithURL;     // extract from m_playlistContent, contains URL and MediaSequenceNumber
    std::vector<ps_ptr<char>> m_linesWithEXTINF; // extract from m_playlistContent, contains length and metadata
    std::vector<ps_ptr<char>> m_syltLines;       // SYLT line table
    std::vector<uint32_t> m_syltTimeStamp;       // SYLT time table
    std::vector<uint32_t> m_hashQueue;

    static const uint8_t m_tsPacketSize = 188;
    static const uint8_t m_tsHeaderSize = 4;

    std::unique_ptr<Decoder> m_decoder = {};
    ps_ptr<int32_t> m_outBuff;        // Interleaved L/R
    ps_ptr<int32_t> m_samplesBuff48K; // Interleaved L/R
    ps_ptr<char> m_ibuff;             // used in log_info()
    ps_ptr<char> m_lastHost;          // Store the last URL to a webstream
    ps_ptr<char> m_currentHost;       // can be changed by redirection or playlist
    ps_ptr<char> m_lastM3U8host;
#ifdef AUDIO_ENABLE_SPEECH
    ps_ptr<char> m_speechtxt; // stores tts text
#endif
    ps_ptr<char> m_streamTitle; // stores the last StreamTitle
    ps_ptr<char> m_playlistBuff;

    const uint16_t m_plsBuffEntryLen = 256; // length of each entry in playlistBuff
    int m_LFcount = 0;                      // Detection of end of header
    uint32_t m_avr_bitrate = 0;             // average bitrate, median calculated by VBR
    uint32_t m_nominal_bitrate = 0;         // given br from header
    uint32_t m_audioFilePosition = 0;       // current position, counts every readed byte
    uint32_t m_audioDataReadPtr = 0;        // used in playAudioData
    uint32_t m_audioFileSize = 0;           // local and web files
    int m_readbytes = 0;                    // bytes read
    uint32_t m_metacount = 0;               // counts down bytes between metadata
    int m_controlCounter = 0;               // Status within readID3data() and readWaveHeader()
    int32_t m_inputHistory[6] = {0};        // used in resampleTo48kStereo()
    uint8_t m_timeoutCounter = 0;           // timeout counter
    uint8_t m_bitsPerSample = 16;           // bitsPerSample
    uint8_t m_channels = 2;                 //
    uint8_t m_playlistFormat = 0;           // M3U, PLS, ASX
    struct {
        float gain_ls = -999.0f; float gain_peq = -999.0f; float gain_hs = -999.0f;
        uint16_t freq_ls = 0; uint16_t freq_peq = 0; uint16_t freq_hs = 0;
        uint32_t sampleRate = 0;
    } m_last_eq;
    uint8_t m_codec = CODEC_NONE;           //
    uint8_t m_m3u8Codec = CODEC_AAC;        // codec of m3u8 stream
    uint8_t m_expectedCodec = CODEC_NONE;   // set in connecttohost (e.g. http://url.mp3 -> CODEC_MP3)
    uint8_t m_expectedPlsFmt = FORMAT_NONE; // set in connecttohost (e.g. streaming01.m3u) -> FORMAT_M3U)
    uint8_t m_streamType = ST_NONE;         //
    uint8_t m_ID3Size = 0;                  // lengt of ID3frame - ID3header
    uint8_t m_audioTaskCoreId = 0;          //
#ifdef AUDIO_CODEC_M4A
    uint8_t m_M4A_objectType = 0;  // set in read_M4A_Header
    uint8_t m_M4A_chConfig = 0;    // set in read_M4A_Header
    uint16_t m_M4A_sampleRate = 0; // set in read_M4A_Header
#endif
    int16_t m_validSamples = 0;          //
    int16_t m_curSample = 0;             //
    uint16_t m_dataMode = 0;             // Statemaschine
    uint16_t m_streamTitleHash = 0;      // remember streamtitle, ignore multiple occurence in metadata
    uint16_t m_timeout_ms = 250;         //
    uint16_t m_timeout_ms_ssl = 2700;    //
    uint32_t m_metaint = 0;              // Number of databytes between metadata
    uint32_t m_chunkcount = 0;           // Counter for chunked transfer
    uint32_t m_t0 = 0;                   // store millis(), is needed for a small delay
    uint32_t m_bytesNotConsumed = 0;     // pictures or something else that comes with the stream
    uint64_t m_lastGranulePosition = 0;  // necessary to calculate the duration in OPUS and VORBIS
    int32_t m_resumeFilePos = -1;        // the return value from stopSong(), (-1) is idle
    int32_t m_fileStartTime = -1;        // may be set in connecttoFS()
    uint16_t m_m3u8_targetDuration = 10; //
    uint32_t m_stsz_numEntries = 0;      // num of entries inside stsz atom (uint32_t)
    uint32_t m_stsz_position = 0;        // pos of stsz atom within file
    uint32_t m_haveNewFilePos = 0;       // user changed the file position
    bool m_f_metadata = false;           // assume stream without metadata
    bool m_f_I2S_init = false;           //
    bool m_f_unsync = false;             // set within ID3 tag but not used
    bool m_f_exthdr = false;             // ID3 extended header
    bool m_f_ssl = false;                //
    bool m_f_running = false;            //
    bool m_f_firstCall = false;          // InitSequence for processWebstream and processLokalFile
    bool m_f_firstLoop = false;          // InitSequence in loop()
    bool m_f_firstPlayCall = false;      // InitSequence for playAudioData
    bool m_f_ID3v1TagFound = false;      // ID3v1 tag found
    bool m_f_chunked = false;            // Station provides chunked transfer
    bool m_f_firstmetabyte = false;      // True if first metabyte (counter)
    bool m_f_playing = false;            // valid mp3 stream recognized
#ifdef AUDIO_ENABLE_SPEECH
    bool m_f_tts = false; // text to speech
#endif
    bool m_f_ogg = false;                 // OGG stream
    bool m_f_forceMono = false;           // if true stereo -> mono
    bool m_f_output48KHz = false;         // resample to I2S 48000Hz
    bool m_f_rtsp = false;                // set if RTSP is used (m3u8 stream)
    bool m_f_m3u8data = false;            // used in processM3U8entries
    bool m_f_continue = false;            // next m3u8 chunk is available
    bool m_f_ts = true;                   // transport stream
    bool m_f_m4aID3dataAreRead = false;   // has the m4a-ID3data already been read?
    bool m_f_psramFound = false;          // set in constructor, result of psramInit()
    bool m_f_timeout = false;             //
    bool m_f_audioTaskIsRunning = false;  //
    bool m_f_allDataReceived = false;     //
    bool m_f_stream = false;              // stream ready for output?
    bool m_f_decode_ready = false;        // if true data for decode are ready
    bool m_f_eof = false;                 // end of file
    bool m_f_lockInBuffer = false;        // lock inBuffer for manipulation
    bool m_f_audioTaskIsDecoding = false; //
    bool m_f_acceptRanges = false;        //
    bool m_f_reset_m3u8Codec = true;      // reset codec for m3u8 stream
    bool m_f_connectionClose = false;     // set in parse HttpResponseHeader
    bool m_f_i2s_channel_enabled = false; // true if enabled
    uint32_t m_audioFileDuration = 0;     // seconds
    uint32_t m_audioCurrentTime = 0;      // seconds

    uint32_t m_audioDataStart = 0; // in bytes
    size_t m_audioDataSize = 0;    //
    size_t m_ibuffSize = 0;        // log buffer size for audio_info()
    size_t m_i2s_bytesWritten = 0; // set in i2s_write() but not used

    pid_array m_pidsOfPMT;
    int16_t m_pidOfAAC;
    uint8_t m_packetBuff[m_tsPacketSize];
    int16_t m_pesDataLength = 0;

    // audiolib structs
#if defined(AUDIO_CODEC_MP3) || defined(AUDIO_CODEC_AAC)
    audiolib::ID3Hdr_t m_ID3Hdr;
#endif
    audiolib::pwsHLS_t m_pwsHLS;
    audiolib::pplM3u8_t m_pplM3U8;
#ifdef AUDIO_CODEC_M4A
    audiolib::m4aHdr_t m_m4aHdr;
#endif
    audiolib::plCh_t m_plCh;
    audiolib::lVar_t m_lVar;
    audiolib::prlf_t m_prlf;
    audiolib::cat_t m_cat;
    audiolib::ifCh_t m_ifCh;
    audiolib::tspp_t m_tspp;
    audiolib::pwst_t m_pwst;
    audiolib::gchs_t m_gchs;
    audiolib::pwf_t m_pwf;
    audiolib::pad_t m_pad;
    audiolib::sbyt_t m_sbyt;
    audiolib::rmet_t m_rmet;
    audiolib::pwsts_t m_pwsst;
#ifdef AUDIO_CODEC_WAV
    audiolib::rwh_t m_rwh;
#endif
#ifdef AUDIO_CODEC_FLAC
    audiolib::rflh_t m_rflh;
#endif
    audiolib::phreh_t m_phreh;
    audiolib::phrah_t m_phrah;
    audiolib::sdet_t m_sdet;
    audiolib::fnsy_t m_fnsy;
    audiolib::audioItems_t m_audio_items;
    audiolib::vu_items_t m_vu_items;
    audiolib::fft_items_t m_fft_items;
    audiolib::i2s_items_t m_i2s_items;
    audiolib::resampler_t m_resampler;

    // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
public:
    // 🎯 overload for char*-Pointer (maybe nullptr)
    static const char *safe_arg(const char *v) { return v ? v : "(null)"; }
    static char *safe_arg(char *v) { return v ? v : (char *)"(null)"; }

    // 🎯 overload for char-Arrays (never nullptr)
    template <size_t N>
    static const char *safe_arg(const char (&v)[N]) { return v; }

    // 🎯 overload for string
    static const char *safe_arg(const std::string &v) { return v.c_str(); }

    // 🎯 overload for string_view
    static const char *safe_arg(std::string_view v)
    {
        return v.data(); // Achtung: evtl. nicht nullterminiert
    }

    // 🎯 Catch-all for all other types
    template <typename T>
    static auto safe_arg(T &&v) -> decltype(auto) { return std::forward<T>(v); }

    // specialization for nullptr / NULL
    static const char *safe_arg(std::nullptr_t) { return "(null)"; }

    template <typename... Args>
    static bool info(Audio &instance, event_t e, const char *fmt, Args &&...args)
    {
        std::lock_guard<std::mutex> lock(instance.mutex_info); // lock mutex
                                                               // -------------------------------------------------------------------------------------------------------------------
        auto extract_last_number = [](std::string_view s) -> int32_t
        {
            // start from the back
            auto it = s.end();
            // skip whitespaces at the end (if available)
            while (it != s.begin() && std::isspace(static_cast<unsigned char>(*(it - 1))))
            {
                --it;
            }

            auto end = it; // potential end of the number

            // Now only search digits backwards
            while (it != s.begin() && std::isdigit(static_cast<unsigned char>(*(it - 1))))
            {
                --it;
            }

            // Check: is there a space before it?
            if (it != s.begin() && std::isspace(static_cast<unsigned char>(*(it - 1))))
            {
                std::string_view number{it, static_cast<size_t>(end - it)};
                uint32_t value{};
                auto [p, ec] = std::from_chars(number.data(), number.data() + number.size(), value);
                if (ec == std::errc{})
                {
                    return static_cast<int32_t>(value);
                }
            }

            return -1; // no number found in the end
        };
        // -------------------------------------------------------------------------------------------------------------------
        if (!fmt)
            return false;
        if (!audio_info_callback)
            return false;
        ps_ptr<char> result;
        // First run: determine size
        int len = std::snprintf(nullptr, 0, fmt, safe_arg(std::forward<Args>(args))...);
        if (len <= 0)
            return false;
        result.calloc(len + 1);
        char *p = result.get();
        if (!p)
            return false;
        std::snprintf(p, len + 1, fmt, safe_arg(std::forward<Args>(args))...);
        msg_t i = {0};
        i.msg = result.c_get();
        i.e = e;
        i.s = eventStr[e];
        i.arg1 = extract_last_number(result.c_get());
        i.i2s_num = instance.m_i2s_items.i2s_num;
        audio_info_callback(i);
        result.reset();
        return true;
    }

    static bool info(Audio &instance, event_t e, std::vector<uint32_t> &v)
    {
        if (!audio_info_callback)
            return false;
        ps_ptr<char> apic;
        apic.assignf("APIC found at pos %lu", v[0]);
        msg_t i;
        i.msg = apic.c_get();
        i.e = e;
        i.s = eventStr[e];
        i.i2s_num = instance.m_i2s_items.i2s_num;
        i.vec = v;
        audio_info_callback(i);
        return true;
    }
    //----------------------------------------------------------------------------------------------------------------------

    template <typename... Args>
    static void AUDIO_LOG_IMPL(uint8_t level, const char *path, int line, const char *fmt, Args &&...args)
    {

#define ANSI_ESC_RESET "\033[0m"
#define ANSI_ESC_BLACK "\033[30m"
#define ANSI_ESC_RED "\033[31m"
#define ANSI_ESC_GREEN "\033[32m"
#define ANSI_ESC_YELLOW "\033[33m"
#define ANSI_ESC_BLUE "\033[34m"
#define ANSI_ESC_MAGENTA "\033[35m"
#define ANSI_ESC_CYAN "\033[36m"
#define ANSI_ESC_WHITE "\033[37m"

        ps_ptr<char> logStr;
        logStr.copy_from(path);
        while (logStr.contains("/"))
        {
            logStr.remove_before('/', false);
        }
        logStr.appendf(":%i ", line);

        if (level == 1 && CORE_DEBUG_LEVEL >= 1)
        {
            logStr.append(ANSI_ESC_RED);
        }
        else if (level == 2 && CORE_DEBUG_LEVEL >= 2)
        {
            logStr.append(ANSI_ESC_YELLOW);
        }
        else if (level == 3 && CORE_DEBUG_LEVEL >= 3)
        {
            logStr.append(ANSI_ESC_GREEN);
        }
        else if (level == 4 && CORE_DEBUG_LEVEL >= 4)
        {
            logStr.append(ANSI_ESC_CYAN);
        } // debug
        else if (level == 5 && CORE_DEBUG_LEVEL >= 4)
        {
            logStr.append(ANSI_ESC_WHITE);
        } // verbose
        else
            return;

